app/controllers/home_controller.rb

  def index
    if current_user
      @posts = Post.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT * FROM "posts"