app/controllers/posts_controller.rb

INSERT INTO "posts" ("image", "description", "user_id", "created_at", "updated_at") VALUES('instrument1.jpg', '#Guitar1 #Instrument', 1, '2021-08-16 07:48:33', '2021-08-16 07:48:33')
---
  def create
    @post = Post.new(params[:post])

    if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 15)
DELETE FROM "posts" WHERE "id" = 15
---
  def destroy
    @post = Post.find(params[:id])
    if @post.destroy