app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @posts = @user.posts.all
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "posts" WHERE ("posts".user_id = 1)

    def update
        current_user = User.find(params[:id])
        current_user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "phone" = 1234556, "updated_at" = '2021-08-16 10:16:29', "gender" = 'Female', "name" = 'Cindy', "website" = 'cindy@example.com', "bio" = 'Hello', "username" = 'Cindy', "avatar" = 'instragram.jpg' WHERE "id" = 2